# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

print('Введите количество элементов в списке');
n = int(input ())
# генерация списка случайных чисел
import random
list = [random.randint(1,10) for x in range(n)]
print(list)

i = 0
m = 0
while i < n/2+1:
    m = list[i] * list[n-1]
    i = i + 1 
    n = n - 1
    print(m)
     
